app/controllers/users_controller.rb

INSERT INTO "users" ("nome", "email", "idade", "created_at", "updated_at", "tempo") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "asasa"], ["email", "sasa"], ["idade", 11], ["created_at", "2020-08-24 18:32:10.472921"], ["updated_at", "2020-08-24 18:32:10.472921"], ["tempo", "2020-08-24"]]
---
  def create
    @user = User.new(user_params)
    @user.tempo = Time.now

    respond_to do |format|
      if @user.save

UPDATE "users" SET "idade" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["idade", 26], ["updated_at", "2020-08-24 14:44:30.794417"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)