app/jobs/add_user_job.rb

  def perform(*args)
    loop do
      @user = User.new()
      @user.nome = ['Henrique', 'Felipe', 'Tiago'].sample
      @user.email = ['henrique@teste.com', 'felipe@teste.com', 'tiago@teste.com'].sample
      @user.idade = rand(0..99)
      @user.avatar = nil
      @user.tempo = Time.now

      if @user.save
---
INSERT INTO "users" ("nome", "email", "idade", "created_at", "updated_at", "tempo") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"